app/controllers/checkpoints_controller.rb

  def index
    @checkpoints = Checkpoint.all
---
SELECT `checkpoints`.* FROM `checkpoints`