app/controllers/checkouts_controller.rb

  def index
    @mushers = Musher.find(:all, :order => 'bibnum')
    @checkpoints = Checkpoint.find(:all, :order => 'sequence')
    if params[:search] and params[:search] != "" then
      musher = Musher.find(:all, :conditions => "bibnum = #{params[:search]}")
      @checkouts = Checkout.find(:all, :conditions => "musher_id = #{musher[0].id}")
    else
      @checkouts = Checkout.paginate(:page => params[:page], :per_page => 25, :order => 'time DESC')
---
SELECT `mushers`.* FROM `mushers` WHERE `mushers`.`id` = 1 LIMIT 1
SELECT `checkpoints`.* FROM `checkpoints` WHERE `checkpoints`.`id` = 4 LIMIT 1
SELECT `checkouts`.* FROM `checkouts` ORDER BY time DESC LIMIT 25 OFFSET 0