app/controllers/checkins_controller.rb

SELECT `mushers`.* FROM `mushers` WHERE `mushers`.`id` = 1 LIMIT 1
SELECT `checkpoints`.* FROM `checkpoints` WHERE `checkpoints`.`id` = 5 LIMIT 1
SELECT `checkins`.* FROM `checkins` ORDER BY time DESC LIMIT 25 OFFSET 0
---
  def index
    @mushers = Musher.find(:all, :order => 'bibnum')
    @checkpoints = Checkpoint.find(:all, :order => 'sequence')
    if params[:search] and params[:search] != "" then
      #@checkins = Checkin.search(params[:search], params[:page])
      musher = Musher.find(:all, :conditions => "bibnum = #{params[:search]}")
      @checkins = Checkin.find(:all, :conditions => "musher_id = #{musher[0].id}")
    else
     @checkins = Checkin.paginate(:page => params[:page], :per_page => 25, :order => 'time DESC')