app/controllers/login_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 765557111 LIMIT 1
---
  def index
		@user = User.find(:all, :conditions => [ "id = ?", "#{session[:user_id]}"])

INSERT INTO `users` (`access_level`, `created_at`, `email`, `hashed_password`, `name`, `salt`, `updated_at`) VALUES ('user', '2011-10-26 02:21:58', 'sue@nosnowkennels.com', '41bf5bafe5bdcbfdbe5cfc090828762eea7a519d', 'sue', '21705970800.0968765237228043', '2011-10-26 02:21:58')
---
  def add_user
    return if session[:admin] == nil
		if session[:admin] == "admin"
				@user = User.new(params[:user])
				if request.post? and @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 765557111 LIMIT 1
---
  def list_users
   return if session[:admin] == nil
  	if session[:admin] == "admin"
    	@all_users = User.find(:all)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 765557111 LIMIT 1
---
  def logout
    user = User.find(:all, :conditions => [ "id = ?", "#{session[:user_id]}"])