app/controllers/mushers_controller.rb

  def index
    @statuses = Status.all
---
SELECT `statuses`.* FROM `statuses`

  def new
    @statuses = Status.all
---
SELECT `statuses`.* FROM `statuses`

  def create
    @statuses = Status.all
    @musher = Musher.new(params[:musher])

    respond_to do |format|
      if @musher.save
---
SELECT `statuses`.* FROM `statuses`
INSERT INTO `mushers` (`bibnum`, `created_at`, `dogs`, `name`, `restartdiff`, `status_id`, `stpos`, `updated_at`, `year`) VALUES (99, '2011-10-26 02:17:30', 16, 'Allen Sue', 6, 7, 3, '2011-10-26 02:17:30', 2012)