app/controllers/standings_controller.rb

	def index
    @checkpoints = Checkpoint.find(:all)
    if params[:search] and params[:search] != "" then
      musher = Musher.find(:all, :conditions => "bibnum = #{params[:search]}")
---
SELECT `checkpoints`.* FROM `checkpoints` WHERE (name = 'Happy Trails (Finish)')
SELECT `mushers`.* FROM `mushers` WHERE (name = 'Buser Rohn')