app/controllers/statuses_controller.rb

SELECT `statuses`.* FROM `statuses`
---
  def index
    @statuses = Status.all