app/controllers/timedcps_controller.rb

  def index
    @timedcps = Timedcp.all
---
SELECT `timedcps`.* FROM `timedcps`